"""
3. Осуществить программу работы с органическими клетками, состоящими из ячеек. Необходимо
создать класс «Клетка». В его конструкторе инициализировать параметр, соответствующий
количеству ячеек клетки (целое число). В классе должны быть реализованы методы
перегрузки арифметических операторов: сложение (__add__()), вычитание (__sub__()),
умножение (__mul__()), деление (__floordiv____truediv__()). Эти методы должны применяться
только к клеткам и выполнять увеличение, уменьшение, умножение и округление до целого
числа деления клеток соответственно.
Сложение. Объединение двух клеток. При этом число ячеек общей клетки должно равняться
сумме ячеек исходных двух клеток.
© geekbrains.ru 20
Вычитание. Участвуют две клетки. Операцию необходимо выполнять, только если разность
количества ячеек двух клеток больше нуля, иначе выводить соответствующее сообщение.
Умножение. Создаётся общая клетка из двух. Число ячеек общей клетки — произведение
количества ячеек этих двух клеток.
Деление. Создаётся общая клетка из двух. Число ячеек общей клетки определяется как
целочисленное деление количества ячеек этих двух клеток.
В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и
количество ячеек в ряду. Этот метод позволяет организовать ячейки по рядам.
Метод должен возвращать строку вида *****\n*****\n*****..., где количество ячеек между \n
равно переданному аргументу. Если ячеек на формирование ряда не хватает, то в последний
ряд записываются все оставшиеся.
Например, количество ячеек клетки равняется 12, а количество ячеек в ряду — 5. В этом
случае метод make_order() вернёт строку: *****\n*****\n**.
Или количество ячеек клетки — 15, а количество ячеек в ряду равняется 5. Тогда метод
make_order() вернёт строку: *****\n*****\n*****.
"""
import math


class Cell:
    def __init__(self, number):
        self._number = number

    def __add__(self, other):
        self._number += other._number

    def __sub__(self, other):
        if self._number > other._number:
            self._number -= other._number
        else:
            print('second cell is bigger or equal than fist')

    def __mul__(self, other):
        self._number *= other._number

    def __floordiv__(self, other):
        self._number //= other._number

    @property
    def get_number(self):
        return self._number

    def make_order(self, row):

        curr = self._number
        i = math.ceil(curr / row)

        for x in range(i):
            print('*' * min(row, curr))
            curr -= row


cell1 = Cell(10)
print(cell1.get_number)
cell1.make_order(3)

cell2 = Cell(2)

cell1 * cell2
print(cell1.get_number)
cell1.make_order(11)

cell3 = Cell(20)
cell1 - cell3
